src/DataProcessors/PrintFormSetup.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>PrintFormSetup</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/CustomPrintForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>CustomPrintForms</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Template</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>TemplateName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ObjectName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/PrintFormSetup/Forms/CRFormSetup/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter1");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr1 = TempStorageAddress;
	Items.CRFooterImageAddr1.PictureSize = PictureSize.AutoSize;
	
	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter2");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr2 = TempStorageAddress;
	Items.CRFooterImageAddr2.PictureSize = PictureSize.AutoSize;

	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter3");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr3 = TempStorageAddress;
	Items.CRFooterImageAddr3.PictureSize = PictureSize.AutoSize;

EndProcedure

&AtClient
Procedure CRUploadFooter1(Command)
	
	Var SelectedName;
	CRFooterImageAddr1 = "";
	
	NotifyDescription = New NotifyDescription("FileUploadCR1",ThisForm);
	BeginPutFile(NotifyDescription,,"",True);
	
	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter1");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr1 = TempStorageAddress;
	
EndProcedure

&AtClient
Procedure FileUploadCR1(a,b,c,d) Export
	
	PlaceImageFilePO(b,"CRfooter1");
	
EndProcedure

&AtClient
Procedure CRUploadFooter2(Command)
	Var SelectedName;
	CRFooterImageAddr2 = "";
	
	NotifyDescription = New NotifyDescription("FileUploadCR2",ThisForm);
	BeginPutFile(NotifyDescription,,"",True);
	
	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter2");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr2 = TempStorageAddress;

EndProcedure

&AtClient
Procedure FileUploadCR2(a,b,c,d) Export
	
	PlaceImageFilePO(b,"CRfooter2");
	
EndProcedure

&AtClient
Procedure CRUploadFooter3(Command)
	Var SelectedName;
	CRFooterImageAddr3 = "";
	
	NotifyDescription = New NotifyDescription("FileUploadCR3",ThisForm);
	BeginPutFile(NotifyDescription,,"",True);
	
	BinaryLogo = GeneralFunctions.GetFooterPO("CRfooter3");
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	CRFooterImageAddr3 = TempStorageAddress;

EndProcedure

&AtClient
Procedure FileUploadCR3(a,b,c,d) Export
	
	PlaceImageFilePO(b,"CRfooter3");
	
EndProcedure

&AtServer
Procedure PlaceImageFilePO(TempStorageName,imagename)
	
	If NOT TempStorageName = Undefined Then
	
		BinaryData = GetFromTempStorage(TempStorageName);
				
		NewRow = InformationRegisters.CustomPrintForms.CreateRecordManager();
		NewRow.ObjectName = imagename;
		NewRow.TemplateName = imagename;
		NewRow.Template = New ValueStorage(BinaryData, New Deflation(9));
		NewRow.Write();	
		DeleteFromTempStorage(TempStorageName);
		
	EndIf;
	  	
EndProcedure

&AtClient
Procedure UploadLogo(Command)
	
	Var SelectedName;
	ImageAddress = "";
	
	NotifyDescription = New NotifyDescription("FileUpload",ThisForm);
	BeginPutFile(NotifyDescription,,"",True);
	
	//BinaryLogo = GeneralFunctions.GetLogo();
	//TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	//ImageAddress = TempStorageAddress;
	
EndProcedure

&AtClient
Procedure FileUpload(a,b,c,d) Export
	
	PlaceImageFile(b);
	
EndProcedure

&AtServer
Procedure PlaceImageFile(TempStorageName)
	
	If NOT TempStorageName = Undefined Then
		
		BinaryData = GetFromTempStorage(TempStorageName);
		
		NewRow = InformationRegisters.CustomPrintForms.CreateRecordManager();
		NewRow.ObjectName = "logo";
		NewRow.TemplateName = "logo";
		NewRow.Template = New ValueStorage(BinaryData, New Deflation(9));
		NewRow.Write();
		DeleteFromTempStorage(TempStorageName);
		
	EndIf;
	
	BinaryLogo = GeneralFunctions.GetLogo();
	TempStorageAddress = PutToTempStorage(BinaryLogo,UUID);
	ImageAddress = TempStorageAddress;
	
EndProcedure
